In [1]:
import pandas as pd

In [2]:
friends = [{'name':'jone','age':28,'job':'student'},{'name':'alex','age':23,'job':'pd'}]

In [7]:
df = pd.DataFrame(friends)

In [4]:
df

   name  age      job
0  jone   28  student
1  alex   23       pd

In [5]:
df = df[['name','job','age']]

In [6]:
df

[['name', 'job', 'age']]

In [8]:
df = pd.DataFrame(friends)

In [9]:
df = df[['name','job','age']]

In [10]:
df

   name      job  age
0  jone  student   28
1  alex       pd   23

In [11]:
df.to_csv('friend_r')

In [12]:
friends = [{'name':'jone','age':28,'job':'student'},{'name':'alex','age':23,'job':'pd'},{'name':'kwon','age':24,'job':None}]

In [13]:
df = pd.DataFrame(friends)

In [14]:
df

   name  age      job
0  jone   28  student
1  alex   23       pd
2  kwon   24     None

In [15]:
df = df[['name','job','age']]

In [16]:
df

   name      job  age
0  jone  student   28
1  alex       pd   23
2  kwon     None   24

In [18]:
df.to_csv('friends_r2',index=False,na_rep='-')